[
  {
    "score": 0,
    "comment": "Bruh… not even one? It's giving 'boomer vibes.' Time to binge-watch TikTok or something. Try another quiz and redeem yourself, fr.",
    "meme": "https://i.kym-cdn.com/photos/images/newsfeed/001/504/679/f24.jpg"
  },
  {
    "score": 1,
    "comment": "This ain’t it, chief. You’re in your flop era when it comes to Gen Z slang. But hey, there’s always a redo. Take another quiz and glow up, fam.",
    "meme": "https://i.kym-cdn.com/photos/images/newsfeed/001/351/697/420.jpg"
  },
  {
    "score": 2,
    "comment": "Oof, that's a low-key L. It’s giving 'early 2000s,' but don’t trip. Hit up another quiz and level up your slang game.",
    "meme": "https://i.kym-cdn.com/entries/icons/original/000/025/882/oof.jpg"
  },
  {
    "score": 3,
    "comment": "Sheeesh, 3/10? You might still think 'lit' is the move. Time to hit refresh. Wanna redeem yourself? Try another quiz, no cap.",
    "meme": "https://i.kym-cdn.com/photos/images/original/002/108/121/3fb.jpg"
  },
  {
    "score": 4,
    "comment": "Okay, 4/10… you’re kind of catching the vibe, but it’s still giving 'mid.' Take another quiz, maybe you’ll finally pop off.",
    "meme": "https://pbs.twimg.com/media/FK0f-pzWYAE9ejX.jpg"
  },
  {
    "score": 5,
    "comment": "Ayy, 50/50! You’re halfway to the Gen Z slang fluency, but you’re also halfway in 'sus' territory. Go ahead, take another quiz and level up that riz.",
    "meme": "https://i.kym-cdn.com/entries/icons/mobile/000/033/704/cover4.jpg"
  },
  {
    "score": 6,
    "comment": "Not bad, not bad. Low-key vibing with a 6/10. You’re slang-savvy, but let’s go for full Gen Z energy. Run another quiz and glow up!",
    "meme": "https://i.imgflip.com/5zmxbw.jpg"
  },
  {
    "score": 7,
    "comment": "7/10, you understood the assignment… but there’s room for a slay upgrade. Time to double down, take another quiz and reach main character energy.",
    "meme": "https://i.kym-cdn.com/photos/images/original/002/097/093/4b4.jpg"
  },
  {
    "score": 8,
    "comment": "No cap, you kinda ate that! But you missed a couple of slang gems. Run another quiz and secure your spot as the certified Gen Z GOAT.",
    "meme": "https://i.kym-cdn.com/entries/icons/mobile/000/034/726/no_cap.jpg"
  },
  {
    "score": 9,
    "comment": "You snapped! 9/10? That’s some serious Gen Z drip right there. You’re one slang away from legend status. One more quiz and you’re golden, fam.",
    "meme": "https://i.imgflip.com/7lmnq9.jpg"
  },
  {
    "score": 10,
    "comment": "BIG W! You’re giving absolute main character energy with this 10/10. Certified GOAT in Gen Z slang. But don’t stop now—take another quiz and keep that vibe strong.",
    "meme": "https://pbs.twimg.com/media/EysbUhUVIAIXi4h.jpg"
  }
]
